[{"word":"private","definitions":["Secluded from the sight, presence, or intrusion of others:  a private hideaway. ","Designed or intended for one's exclusive use:  a private room. ","Of or confined to the individual; personal:  a private joke; private opinions. ","Undertaken on an individual basis:  private studies; private research. ","Of, relating to, or receiving special hospital services and privileges:  a private patient. ","Not available for public use, control, or participation:  a private club; a private party. ","Belonging to a particular person or persons, as opposed to the public or the government:  private property. ","Of, relating to, or derived from nongovernment sources:  private funding. ","Conducted and supported primarily by individuals or groups not affiliated with governmental agencies or corporations:  a private college; a private sanatorium. ","Enrolled in or attending a private school:  a private student. ","Not holding an official or public position:  a private citizen. ","Not for public knowledge or disclosure; secret:  private papers; a private communication. ","Not appropriate for use or display in public; intimate:  private behavior; a private tragedy. ","Placing a high value on personal privacy:  a private person. ","A noncommissioned rank in the U.S. Army or Marine Corps that is below private first class.","One who holds this rank or a similar rank in a military organization.","Private parts. Often used with the.","go private  To take a publicly owned company into private ownership, as by a leveraged buyout.","in private  Not in public; secretly or confidentially."],"examples":["VIEW FAVORITES yahooBuzzArticleHeadline = '\"Tax Farming\" by Private Collectors Starts This Week at IRS'; yahooBuzzArticleSummary = 'IRS to spend $75 million with 3 [x] collection agencies (GOP connected?) and give them \\'personal, [x]\\' information on 12,500 US taxpayers who owe less than $25,000.","Re Shaun's comment on 4\/1\/05 see above that includes this sentence: \"As I said before, my issue isn't with the sexual orientation, it's with people who lack the discretion to keep their [x] lives *[x]*\"; and this one: \"Were I to go into work Monday morning and regale my coworkers with tales of my sexual exploits, I'd likely lose my job.\"","But, by one who speaks without notes is generally understood one who has only memorised his leading ideas, and it is always a judicious practice for a beginner to rehearse his leading topics and their amplifications in [x], _that he may test his memory_, and then _become familiar_ with a procedure _in [x]_ in order to be sure to be _perfect in it before the public_.","Instead of _taking_ \"[x] property,\" Congress, by abolishing slavery, would say \"_[x] property_ shall not _be_ taken; and those who have been robbed of it already, shall be kept out of it no longer; and since every man's right to his own body is _paramount_, he shall be protected in it.\"","Instead of _taking_ \"[x] property,\" Congress, by abolishing slavery, would say \"_[x] property_ shall not be taken; and those who have been robbed of it already, shall be kept out of it no longer; and every man's right to his own body shall be protected.\""]},{"word":"state","definitions":["A condition or mode of being, as with regard to circumstances:  a state of confusion. ","A condition of being in a stage or form, as of structure, growth, or development:  the fetal state. ","A mental or emotional condition:  in a manic state. ","Informal   A condition of excitement or distress.","Physics   The condition of a physical system with regard to phase, form, composition, or structure:  Ice is the solid state of water. ","Social position or rank.","Ceremony; pomp:  foreign leaders dining in state at the White House. ","The supreme public power within a sovereign political entity.","The sphere of supreme civil power within a given polity:  matters of state. ","A specific mode of government:  the socialist state. ","A body politic, especially one constituting a nation:  the states of Eastern Europe. ","One of the more or less internally autonomous territorial and political units composing a federation under a sovereign government:  the 48 contiguous states of the Union. ","Of or relating to a body politic or to an internally autonomous territorial or political unit constituting a federation under one government:  a monarch dealing with state matters; the department that handles state security. ","Owned and operated by a state:  state universities. ","To set forth in words; declare."],"examples":["Thus, [x] laws first had to be a valid substantive exercise of the [x]¡¦s police power before it was incorporated into Webb-Kenyon and could be applied to inter[x] shipments of liquor.","Instead, the initial law that the [x] sought to enforce against inter[x] commerce must itself be an externally valid exercise of the [x]¡¦s police power.","COLIN POWELL, SECRETARY OF STATE: And it also gave me the opportunity, as secretary of [x], to thank him and to thank the Canadian people and the Canadian government, especially the prime minister for all the solid support that Canada has given to the United States in the days since the 11th of September.","* Thus, in \"The [x] was made, under the pretence of serving it, in reality the prize of their contention to each of these opposite parties,\" it is unpleasantly doubtful whether the writer means (1) _[x]_ or (2) _parties_ to be emphatic.","It may seem a paradox that the same colour should be at once so durable and so fugitive, but we may briefly explain it by saying _when vitreous pigments are reduced to that extreme [x] of division which the palette requires, they lose the properties they possess in a less finely divided [x]_."]},{"word":"boarding","definitions":["Present participle of board.","the act of people getting aboard a ship or aircraft; embarkation","the act of a sailor or boarding party attacking an enemy ship","a structure made of boards","riding a skateboard","a penalty called for pushing into the boards"],"examples":["Synonymous in many people's minds with the term \"[x] school,\" this bastion of Britishness, founded in 1440, remains a school for boys, unlike many former single-sex schools.","He recalls being awakened each morning at about eight in [x] school with a breakfast of a sweet roll and a cup of steaming hot chocolate, served in bed, whose caffeine content propelled him toward the next meal, brunch, served at about ten.","And I made myself many kinds of spectators, from crabbed old maids and lean pantaloons to girls in [x] school and Greek boys of thousands of years ago.","For instance, the Washington fifth grader (Anthony) is one 61 applicants waiting for 24 spaces that will open up in [x] school.","Water [x] is torture, no matter what your party platform says."]},{"word":"primary","definitions":["First or highest in rank, quality, or importance; principal.","Being or standing first in a list, series, or sequence.","Occurring first in time or sequence; earliest.","Being or existing as the first or earliest of a kind; primitive.","Geology   Characteristic of or existing in a rock at the time of its formation.","Serving as or being an essential component, as of a system; basic. See Synonyms at chief.","Immediate; direct:  a primary effect; a primary information source. ","Preliminary to a later stage in a continuing process:  primary training. ","Of or relating to a primary school:  the primary grades. ","Of or relating to a primary color or colors.","Linguistics   Having a word root or other linguistic element as a basis that cannot be further analyzed or broken down. Used of the derivation of a word or word element.","Linguistics   Referring to present or future time. Used as a collective designation for various present and future verb tenses in Latin, Greek, and Sanskrit.","Electronics   Of, relating to, or constituting an inducting current, circuit, or coil.","Of, relating to, or designating the main flight feathers projecting along the outer edge of a bird's wing.","Of or relating to agriculture, forestry, the industries that extract natural materials from the earth, or the products so obtained:  a primary commodity. ","Chemistry   Relating to the replacement of one of several atoms or radicals in a compound by another atom or radical.","Chemistry   Having a carbon atom attached solely to one other carbon atom in a molecule.","Botany   Of, relating to, or derived from a primary meristem.","One that is first in time, order, or sequence.","One that is first or best in degree, quality, or importance.","One that is fundamental, basic, or elemental.","A meeting of the registered voters of a political party for the purpose of nominating candidates and for choosing delegates to their party convention.","A preliminary election in which the registered voters of a political party nominate candidates for office.","A primary color.","A primary flight feather.","Electronics   An inducting current, circuit, or coil.","Astronomy   A celestial body, especially a star, relative to other bodies in orbit around it.","Astronomy   The brighter of two stars that make up a double star."],"examples":["I think your question is, if the [x] ends tomorrow, what happens to Obama's * [x]* money.","Since the energy in the two circuits will be practically the same, it follows _that the ratio between the current in the [x] and that in the secondary will be equal to the ratio of the number of turns in the secondary to the number of turns in the [x]_.","The [x] art is writing; \u0097[x], if we regard the purpose abstracted from the different modes of realizing it, those steps of progression of which the instances are still visible in the lower degrees of civilization.","In telephony, where the currents are not simple periodic currents, and where the variations in current strength take place at different rates, such a law as that just stated does not hold for all cases; but it may be stated in general that _the induced currents will be of higher voltage and smaller current strength than those of the [x] in all coils where the secondary winding has a greater number of turns than the [x]_, and _vice versâ_.","I use the term \"[x]\" because the change process actually requires you make several changes, which means making supplement goals."]},{"word":"secondary","definitions":["Of the second rank; not primary.","Inferior.","Minor; lesser.","Derived from what is primary or original:  a secondary source; a secondary infection. ","Of, relating to, or being the shorter flight feathers projecting along the inner edge of a bird's wing.","Electricity   Having an induced current that is generated by an inductively coupled primary. Used of a circuit or coil.","Chemistry   Characterized or formed by replacement of two atoms or radicals within a molecule. Used of a compound.","Geology   Produced from another mineral by decay or alteration.","Of or relating to a secondary school:  secondary education. ","Of or relating to a secondary color or colors.","Being a degree of health care intermediate between that offered in a physician's office and that available at a research hospital, as the care typically offered at a clinic or community hospital.","Botany   Of, relating to, or derived from a lateral meristem, especially a cambium.","One that acts in an auxiliary, subordinate, or inferior capacity.","One of the shorter flight feathers projecting along the inner edge of a bird's wing.","Electricity   A coil or circuit having an induced current.","Astronomy   A celestial body that revolves around another; a satellite.","The dimmer star of a binary star system.","A secondary color.","Football   The defensive backfield."],"examples":["Lorrie Norrington, President of eBay Marketplaces, defined what eBay meant by the term [x] market in answering a two-part question from one of the analysts in attendance.","After exactly two decades, Dr Melvyn Kershaw has packed up his rucksack and left the comprehensive whose stewardship has earned him the title [x] school headteacher of the year.","The defense loses five starters, but defensive tackle Jared Crick anchors a strong line, and the [x] is the deepest it's been in years.","Sarwer, can't guarantee satisfaction for patients who yearn for what he calls [x] benefits, such as, 'I'm recently widowed and want to get back into the dating scene.'","In addition to the line, the [x] is a question mark for the Terrapins, who will be looking for Kenny Tate and Antwine Perez to step up their game now that they are the projected starters at safety, while redshirt freshman Dexter McDougle could find himself starting at corner."]},{"word":"hight","definitions":["Archaic   Named or called."],"examples":["Gui, Add, Text, x5 y5 w200 h20, The [x] is \\% [x]\\%, \\% scan_y_start\\% - \\% scan_y_end\\%.","The [x] is \\% [x]\\%, \\% scan_y_start\\% - \\% scan_y_end\\%.","; Add Header for image file format: = \"P3\" comment: = \"#File made in Autohotkey\" [x]: = scan_y_end - scan_y_start width: = scan_x_end - scan_x_start colors: = \"255\" file_data = % format% % comment% % width% % [x]% % colors% % scan_current_line%","I don't think [x] is as important as breaking up your silhouett.","The oil producing countries were looking for an opportunity to bleed the rest of the world to death and they got it when your president decided to raise and maintain [x] tensions in middle east and use your money in fighting a war that is slowly putting your country in bigger debt."]},{"word":"university","definitions":["An institution for higher learning with teaching and research facilities constituting a graduate school and professional schools that award master's degrees and doctorates and an undergraduate division that awards bachelor's degrees.","The buildings and grounds of such an institution.","The body of students and faculty of such an institution."],"examples":["If you'd like to explore how the world of the [x] press world is gettin' free, try this search on Google or Yahoo along with your favorite keywords: \u0093[x] press\u0094 free download site:edu .","Craig then says that \"Goethe tended to be unsympathetic toward [x] intellectuals with liberal views, but this was because he feared that their activities would lead neighboring princes to withdraw their subjects from the [x]\u0085.\"","Speaking there, Zuma said: \"It (University of Zululand) used to be known as a bush [x].","But even when they are not, the popularity of the term [x] in a corporate setting speaks to important truths.","There were challenges from government officials over its use of the term \"[x] college\", as it had not been granted such a status and does not have its own degree-awarding powers."]},{"word":"college","definitions":["An institution of higher learning that grants the bachelor's degree in liberal arts or science or both.","An undergraduate division or school of a university offering courses and granting degrees in a particular field.","A school, sometimes but not always a university, offering special instruction in professional or technical subjects.","The students, faculty, and administration of such a school or institution.","The building or buildings occupied by such a school or institution.","Chiefly British   A self-governing society of scholars for study or instruction, incorporated within a university.","An institution in France for secondary education that is not supported by the state.","A body of persons having a common purpose or shared duties:  a college of surgeons. ","An electoral college.","A body of clerics living together on an endowment."],"examples":["Wasn't it enough that I and my family lived on her, that I must come to her on purpose to rile her with my talk about [x] -- _[x]!","I have a notion -- only do not whisper such heresy within [x] walls -- that a [x] tutor must be genteel in his _[x] judgments_, that 'The Polite Letter","The term \"[x] student\" comes with its own luxuries, including enjoying weekend parties, procrastinating papers until an hour before deadline no such thing at a real job!","For instance, according to Google Insights for Search, the term \"[x] football\" is searched for about 5 times as often in Birmingham, Alabama as it is in New York City, relative to overall search traffic.","The quantity of seats available in [x] is relatively fixed (over the short-term, anyway)."]},{"word":"business","definitions":["The occupation, work, or trade in which a person is engaged:  the wholesale food business. ","A specific occupation or pursuit:  the best designer in the business. ","Commercial, industrial, or professional dealings:  new systems now being used in business. ","A commercial enterprise or establishment:  bought his uncle's business. ","Volume or amount of commercial trade:  Business had fallen off. ","Commercial dealings; patronage:  took her business to a trustworthy salesperson. ","One's rightful or proper concern or interest: \"The business of America is business”  ( Calvin Coolidge). ","Something involving one personally:  It's none of my business. ","Serious work or endeavor:  got right down to business. ","An affair or matter: \"We will proceed no further in this business”  ( Shakespeare). ","An incidental action performed by an actor on the stage to fill a pause between lines or to provide interesting detail.","Informal   Verbal abuse; scolding:  gave me the business for being late. ","Obsolete   The condition of being busy."],"examples":["Follow the latest [x] news, comment and analysis on Twitter jilltreanor: Quite astonishing that the banks are not compelled to provide details of their own lending commitments under Project Merlin #[x] about 13 hours, 46 minutes ago jilltreanor: There is nothing in Project Merlin that appears to \"force\" banks to lend.","He started in again about [x], without explaining exactly _what _[x] he was in.","I understand that companies that have losing [x] models often find it more profitable to invest outside of their [x]**, but GM seems to have found the only investment on the planet worse than their own stock.","The ­secrets of [x], he said, were to be found in ­history, literature and the classic ruminations on life and existence, not in the half-baked ramblings of ­[x] academics, consultants and “gurus.”","Virgil Thomson wrote crushingly of \"Porgy and Bess\" that \"it is clear, by now, that Gershwin hasn't learned the [x] of being a serious composer, which one has ­always gathered to be the ­[x] he wanted to learn,\" though Thomson spoke more kindly of him off the record."]},{"word":"engineering","definitions":["The application of scientific and mathematical principles to practical ends such as the design, manufacture, and operation of efficient and economical structures, machines, processes, and systems.","The profession of or the work performed by an engineer.","Skillful maneuvering or direction:  geopolitical engineering; social engineering. "],"examples":["I'm not paying for it, 'blunt arrogance', These two ladies will realise one day its [x] the nation, not 'domestic [x]'_ \"There are lessons to learn ..\"","That doesn't sound like [x] at all, so you should have truly excellent reasons for saying [x] is responsible for an approach that leaves out two critical steps in [x] as we know it.","After earning a bachelor of science degree in [x] from the University of Michigan, Page decided to concentrate on computer [x] at Stanford University, where he met Sergey Brin.","He received a bachelor's degree in [x] from the University of California at Los Angeles in 1968 and a master's degree in structural [x] from California State University at North Ridge in 1973.","BA and MA in [x] from the University of Illinois at CU, as well as a connection with T. Boone Pickets, and many notices in the India Times."]},{"word":"law","definitions":["A rule of conduct or procedure established by custom, agreement, or authority.","The body of rules and principles governing the affairs of a community and enforced by a political authority; a legal system:  international law. ","The condition of social order and justice created by adherence to such a system:  a breakdown of law and civilized behavior. ","A set of rules or principles dealing with a specific area of a legal system:  tax law; criminal law. ","A piece of enacted legislation.","The system of judicial administration giving effect to the laws of a community:  All citizens are equal before the law. ","Legal action or proceedings; litigation:  submit a dispute to law. ","An impromptu or extralegal system of justice substituted for established judicial procedure:  frontier law. ","An agency or agent responsible for enforcing the law. Often used with the: \"The law . . . stormed out of the woods as the vessel was being relieved of her cargo”  ( Sid Moody). ","Informal   A police officer. Often used with the.","The science and study of law; jurisprudence.","Knowledge of law.","The profession of an attorney.","Something, such as an order or a dictum, having absolute or unquestioned authority:  The commander's word was law. ","The body of principles or precepts held to express the divine will, especially as revealed in the Bible.","The first five books of the Hebrew Scriptures.","A code of principles based on morality, conscience, or nature.","A rule or custom generally established in a particular domain:  the unwritten laws of good sportsmanship. ","A way of life:  the law of the jungle. ","A statement describing a relationship observed to be invariable between or among phenomena for all cases in which the specified conditions are met:  the law of gravity. ","A generalization based on consistent experience or results:  the law of supply and demand. ","Mathematics   A general principle or rule that is assumed or that has been proven to hold between expressions.","A principle of organization, procedure, or technique:  the laws of grammar; the laws of visual perspective. ","To go to law; litigate.","a law unto (oneself)  A totally independent operator:  An executive who is a law unto herself. ","take the law into (one's) own hands  To mete out justice as one sees fit without due recourse to law enforcement agencies or the courts."],"examples":["I just really hate it when people twist what the state of the [x] is, or make extreme claims with colorful language about what is a fairly unexceptional case *under current [x]*.","It is this feature of the natural [x] that justifies, on Aquinas's view, our calling the natural [x] ˜[x].™","This involves at least two separate claims: In one sense, it can be understood as a thesis about the concept of [x], maintaining that what we call ˜[x]™ can only be those norms which are backed by sanctions of the political sovereign.","Considering that the current [x] and society does not recognize this as legally actionable, I think restore may be a small step in the direction of accountability, *but only if it is applied only to those cases that absolutely cannot be prosecuted under current criminal [x]* I am not refering to provability here, but to whether an alleged act meets the current legal definition of rape.","(TOH-ruh, TAWR-uh, TOY-ruh) The [x] on which Judaism is founded (torah is Hebrew for \u0093[x]\u0094)."]},{"word":"medical","definitions":["Of or relating to the study or practice of medicine.","Requiring treatment by medicine.","Informal   A thorough physical examination."],"examples":["The term \"[x] home\" is misleading, as it refers not to a place but a practice—one in which doctors coordinate primary care for patients with chronic conditions like diabetes.","I personally try to force myself to use the term [x] liability insurance rather than [x] malpractice insurance.","Thirty years ago the phrase \"[x] marijuana\" didn't exist and as I mentioned before, the thought of legalization in the U.S. was a pipe dream no pun intended.",": The term [x] marijuana took on dramatic new meaning in February, 2000 when researchers in Madrid announced they had destroyed incurable brain tumors in rats by injecting them with THC, the active ingredient in cannabis.","Prescription drug abuse, which I term [x] drug addiction, like all addictions including alcoholism, (addiction to ethyl alcohol), though more widely recognized nowadays, is still not widely understood."]},{"word":"teaching","definitions":["The act, practice, occupation, or profession of a teacher.","Something taught.","A precept or doctrine. Often used in the plural:  the teachings of Buddha. ","Of, involving, or used for teaching:  teaching materials; teaching methods. ","Working as a teacher or in teaching:  teaching assistants. "],"examples":["Diary Entry by Alan MacDonald (about the author) yahooBuzzArticleHeadline = 'Let\\'s use the Health Care bill as an Obama \"[x] moment\"'; yahooBuzzArticleSummary = 'Let\\'s use the Health Care bill as an Obama \\'[x] moment\\' --- not him \\'[x] us\\ 'but us \\'[x] him\\'! '","Such omissions may have been plausible in the first blush of enthusiasm for reform, but they seem indefensible after many decades of evidence that adventurous [x] is rare. quoted from 《[x] practice: plus que ca change》, p38","The greatest advancement in [x] is to have players see their swings.","So much of what we think of as “waste” in [x] is actually a diamond in the rough.","The schools performance in [x] is judged by how its graduates perform in their next academic stage (university, college, etc.) compared to other schools."]},{"word":"certificate","definitions":["A document testifying to the truth of something:  a certificate of birth. ","A document issued to a person completing a course of study not leading to a diploma.","A document certifying that a person may officially practice in certain professions.","A document certifying ownership.","To furnish with, testify to, or authorize by a certificate."],"examples":["However, at some later date, a man came to see Rosen and told him that the title [x] to the Ford was in Rosen's name and asked Rosen to sign an assignment of it to some other person.","Apparently Rosen did not sign the title [x] dated July 23, 1936.","[A] t some later date, a man came to see Rosen and told him that the title [x] to the Ford was in Rosen's name and asked Rosen to sign an assignment of it to some other person.","[A] t some later date, a man came to see Rosen and told him that the title [x] to the Ford was in","From the builder, you would need a title [x] or a development agreement and a commencement [x], which is provided by regulatory authorities permitting a builder to start work on a particular plot."]},{"word":"diploma","definitions":["A document issued by an educational institution, such as a university, testifying that the recipient has earned a degree or has successfully completed a particular course of study.","A certificate conferring a privilege or honor.","An official document or charter."],"examples":["UNIDENTIFIED MALE: Is this what you call a [x] mailed (ph) to some extent?","BTW, \"[x]\" is defined as \"a document given by an educational institution conferring a degree on a person or certifying that the person has satisfactorily completed a course of study.\"","Pizza Hut Momma said ... angdesj ... you is just jealous. kg - I got me a [x] from the U of R journalism skool.","“A [x] is a very personal item, and people want to proudly display it in their offices and homes,” said Sidra Qureshi, president of Trinity Diversity Connection.","BUT in the next breadth, of their plan to lower the standards for testing, he said: I want more than anything to be able to say with confidence that every Pennsylvania student who receives a [x] is ready for the real world."]},{"word":"degree","definitions":["One of a series of steps in a process, course, or progression; a stage:  proceeded to the next degree of difficulty. ","A step in a direct hereditary line of descent or ascent:  First cousins are two degrees from their common ancestor. ","Relative social or official rank, dignity, or position.","Relative intensity or amount, as of a quality or attribute:  a high degree of accuracy. ","The extent or measure of a state of being, an action, or a relation:  modernized their facilities to a large degree. ","A unit division of a temperature scale.","Mathematics   A planar unit of angular measure equal in magnitude to  1\/360  of a complete revolution.","A unit of latitude or longitude, equal to  1\/360  of a great circle.","Mathematics   The greatest sum of the exponents of the variables in a term of a polynomial or polynomial equation.","Mathematics   The exponent of the derivative of highest order in a differential equation in standard form.","An academic title given by a college or university to a student who has completed a course of study:  received the Bachelor of Arts degree at commencement. ","A similar title conferred as an honorary distinction.","Law   A division or classification of a specific crime according to its seriousness:  murder in the second degree. ","A classification of the severity of an injury, especially a burn:  a third-degree burn. ","Grammar   One of the forms used in the comparison of adjectives and adverbs. For example, tall is the positive degree, taller the comparative degree, and tallest the superlative degree of the adjective tall.","Music   One of the seven notes of a diatonic scale.","Music   A space or line of the staff.","by degrees  Little by little; gradually.","to a degree  To a small extent; in a limited way:  doesn't like spicy food, but can eat a little pepper to a degree. "],"examples":["No man is so wicked _but_ (conjunctive adverb) he loves virtue = No man is wicked _to that [x] in which_ he loves _not_ virtue (_so_ = _to that [x]_, _but_ = _in which not_).","If it seems to be rolled to a width beyond the normal [x], it should be classified as if rolled only to the normal [x]_.","In whatsoever [x] more of the _man_ and less of the _mechanics_ appear, _in that [x]_ is the result a work of art.","What distinguishes Political Correction, to a certain [x], is the context in which it pursues this partisan role.","For example, one might argue that if the [x] is all that matters, why require attendance?"]},{"word":"post-graduate","definitions":[],"examples":["While there's nothing that you can do to ensure that you'll have a fool-proof, career-guaranteed [x] experience, there are certain things you can do to help.","By the time students complete years of [x] schooling, internships, residencies and fellowships they are usually in their early 30s with the fertility clock well past high noon for women.","After that I did a [x] internship at The Philadelphia Museum of Art; having 2 years of an Andrew Mellon fellowship and then hired on staff.","In western Canada, however, we have many more teacher-librarians with a [x] diploma.","I've devoted 20 years of my career and nine years of [x] education to these issues, and I find them challenging."]},{"word":"maths","definitions":["Chiefly British   Mathematics."],"examples":["Knowing how to write and structure a report, how to do research, how to do [x] is all useful stuff for most people in business as employees or employers or one-man entrepreneurs.","Academically-ambitious upper class American parents and their kids would be better advised to emulate the Asian Americans and join [x]\/science out-of-school clubs than enrolling their kids into sports, arts and 'good works'.","There are many, many reasons why someone reaches adulthood without learning basic skills in [x] and English – for example illness, learning disability, tragic events in the family","As a student she got a D in [x] GCSE but retook the exam at the same time as pupils to get an A*.","Helen Weir has a first-class degree in [x], earns more than £1m a year, is a mother-of-three – and could soon be the first woman to run a top UK bank."]},{"word":"physics","definitions":["The science of matter and energy and of interactions between the two, grouped in traditional fields such as acoustics, optics, mechanics, thermodynamics, and electromagnetism, as well as in modern extensions including atomic and nuclear physics, cryogenics, solid-state physics, particle physics, and plasma physics.","Physical properties, interactions, processes, or laws:  the physics of supersonic flight. ","Archaic   The study of the natural or material world and phenomena; natural philosophy."],"examples":["The undetected \"god particle\" in [x] is the Higgs boson, I would postulate the \"god particle\" in the search for OOL is intelligence, not any mechanism we see in operation today ….","The problem with much of the popular work done in [x] is that you only can get the real picture, if you already know what they are talking about.","All we do in [x] is make observations and formulate mathematical models based in these observations that can be used to predict future observations.","John Bahcall received his BA in [x] from the University of California, Berkeley in 1956 and his Ph.D. from Harvard University in 1961.","Lise Meitner (1878-1968) was an Austrian-born Jew who became only the second woman to earn a doctorate in [x] from the University of Vienna."]},{"word":"electronics","definitions":["The science and technology of electronic phenomena.","Electronic devices and systems:  The electronics aboard the new aircraft are very sophisticated. "],"examples":["Then the term [x] contract manufacturers became popular.","Paul, however, knew mysterious things about what he called [x] and theoretical mathematics and programing.","Regulating and specifying the destination of these [x] is an urgent and necessary condition for us to keep on benefiting from technological advances in a sustainable fashion, without the health of the population and the environment paying an even higher price.","The current import tax for [x] is 15% even if it is made in China, and you are allowed to bring up to 20 CDs or DVDs with you tax free.","After we moved to Cuernavaca a friend of mine here that dabbled in [x] sold me a cell phone complete with a charger, car cord, belt holster, two batteries, (you needed an extra battery in those days) and a $100 Peso phone card for $500 Pesos, that was equivalent to $50 US Bucks at that time."]},{"word":"it","definitions":["Used to refer to that one previously mentioned. Used of a nonhuman entity; an animate being whose sex is unspecified, unknown, or irrelevant; a group of objects or individuals; an action; or an abstraction:  polished the table until it shone; couldn't find out who it was; opened the meeting by calling it to order. ","Used as the subject of an impersonal verb:  It is snowing. ","Used as an anticipatory subject or object:  Is it certain that they will win? ","Used as an anticipatory subject to emphasize a term that is not itself a subject:  It was on Friday that all the snow fell. ","Used to refer to a general condition or state of affairs:  She couldn't stand it. ","Used to refer to a crucial situation or culmination:  This is it—the rivals are finally face to face. That's it! I won't tolerate any more foolishness. ","Informal   Used to refer to something that is the best, the most desirable, or without equal:  He thinks he's it. That steak was really it! ","Games   A player, as in tag, who attempts to find or catch the other players.","An animal that has been neutered:  The cat is an it. ","with it  Slang   Aware of or knowledgeable about the latest trends or developments.","with it  Slang   Mentally responsive and perceptive:  I'm just not with it today. "],"examples":["The knife didn't f[x] in your hand like any knife though,  [x] f[x] like the woodworker sanded [x] to the lines and curves of your own palm.","\u0093Contrary to the talk [of the law's cr[x]ics], \u0094 York declared, \u0093[x] is a reasonable, lim[x]ed, carefully crafted measure ... that went to great lengths to make sure [x] is const[x]utional.","'The soundtrack in my head is Roy Orbison singing \\ \"It\\'s over, [x]\\'s ooooooover, \\\" and [x] doesn\\'t matter that the \\ \"[x]\\\" for him was a love affair and not a college app.","This concept is popular w[x]h investors who want to \u0093set [x] and forget [x]\u0094 as well as those who want a more conservative mix in retirement.","By taking just an hour to create a similar \u0093set [x] and forget [x]\u0094 plan for the rest of your finances, you can set yourself up for a lifetime of financial success while saving yourself from the unnecessary heartaches, stress, and apologies that managing money can otherwise entail."]},{"word":"mechanics","definitions":["The branch of physics that is concerned with the analysis of the action of forces on matter or material systems.","Design, construction, and use of machinery or mechanical structures.","The functional and technical aspects of an activity:  The mechanics of football are learned with practice. "],"examples":["The term [x] generally refers to the motion of large objects, whereas the study of motion at the level of the atom or smaller is the domain of quantum [x].","Having made a fortunate and happy marriage, Saint-Simon was almost constantly at Versailles until the death of the King, and obtained the most intimate acquaintance with what he terms the [x] of the court.","The other talk dealing with what I term the [x] and risks.","I know hardly anything about climate models: anything involving fluid [x] is pretty much a closed book to me.","So I knew the Tab A Slot B [x] from a very early age, and how women got pregnant, and the anatomical specifics of birth, etc."]},{"word":"lesson","definitions":["Something to be learned:  lessons from observing nature. ","A period of instruction; a class.","An assignment or exercise in which something is to be learned.","The act or an instance of instructing; teaching.","An experience, example, or observation that imparts beneficial new knowledge or wisdom.","The knowledge or wisdom so acquired.","A rebuke or reprimand.","A reading from the Bible or other sacred text as part of a religious service.","To teach a lesson to; instruct.","To rebuke or reprimand."],"examples":["And so we see that the second [x] taught by the Transfiguration was the _[x] of instruction_.","The plain [x] from the Times series is that if educators will not examine their own practice and build on it, someone else will do it for them ... and to them.","The main [x] is that it is surprising that so many people could be fooled.","Another plain [x] from the event which brings us together is the call to thankfulness that our honored President was spared to do his great work.","The rest doesn't really matter much and the [x] is always the same: it is better to bare your soul than to sit clenching your teef."]},{"word":"internship","definitions":["A job taken by a student in order to learn a profession or trade."],"examples":["\"The word '[x]' carries no legal definition and therefore often leads to graduate exploitation,\" said Mr Curtis.","TVGuide. com: So does that mean Annie's [x] is kaput too?","Some 74% of business schools saw an increase in [x] opportunities in 2010; in 2009, 69% of schools reported a decline, according to the MBA Career Services Council, an industry group that monitors global M.B.A. employment.","The [x] is unpaid and both full and part-time applicants are encouraged to apply.","The issue with the unpaid private sector [x] is its effect on driving down employment which I kinda thought any member of congress would consider a problem."]},{"word":"student","definitions":["One who is enrolled or attends classes at a school, college, or university.","One who studies something:  a student of contemporary dance. ","An attentive observer:  a student of world affairs. "],"examples":["If I reason, Every [x] who can concentrate his attention can learn quickly, George Marston has a notable power of concentration, Therefore George Marston can learn quickly, I again break up the abstraction _[x]_, and the concrete fact","Here he rubbed shoulders with the future leaders of the Third Reich, including Heinrich Himmler, then an agronomy [x] active in the fraternities, a breeding ground for the budding ­[x] nationalist movement.","This achieves similar results, except saying hello to each [x] in the @[x] array.","The term [x]-athlete meant something to Shannon.","It seems that Randy Shannon lost his job because he believed too much in the term [x]-athlete."]},{"word":"pupil","definitions":["A student under the direct supervision of a teacher or professor.","Law   A minor under the supervision of a guardian.","The apparently black circular opening in the center of the iris of the eye, through which light passes to the retina."],"examples":["The other [x] is also a Scotch Lad Brother to Sir — Ramsey; but I don't like him, and of course he will never come to much.","Often the curiosity of the child concerning a letter leads us to teach that desired consonant; a name pronounced may awaken in him a desire to know what consonants are necessary to compose it, and this will, or willingness, of the [x] is a much more efficacious means than any rule concerning the progression of the letters.","\"Therefore, the Liberal Democrats have proposed the concept of what we call a [x] premium, an enhanced level of funding\".","Huerta argues that HCZ's blanket approach to its neighbourhood's social needs means that the financial cost per [x] is too high to be replicated nationwide.","In fact, the sheer enjoyment of an apt [x] is what leads some academic to try to land jobs at those research 1 schools, where they can teach grad students. musa Says:"]},{"word":"learner","definitions":["One that is learning"],"examples":["All other directions necessary for the [x] in school, as well as for the _private [x]_, will be given in the succeeding pages of the work.","After attending a democratic school and teaching high school and preschool in a democratic environment, I've come to settle on a personal definition of what democratic education is, which unfolds the word \"[x]\" in IDEA's definition.","Nevertheless, good teachers (I argue) have the ability to intuit where the [x] is going, what his\/her present capacities are (their ZPD I guess), and to what extent these capacities can be realised (or, to use your term, ‘moved’) by well-judged interventions.","In any case, I agree with you when you say “good teachers (I argue) have the ability to intuit where the [x] is going, what his\/her present capacities are (their ZPD I guess), and to what extent these capacities can be realised (or, to use your term, ‘moved’) by well-judged interventions.”","In this paper, Harder describes the recuded role of the [x]: “The [x] is not free to define his [sic] place in the ongoing [L2] interaction as he would like; he has to accept a role which is less desirable than he could ordinarily achieve”."]},{"word":"trainee","definitions":["One who is being trained."],"examples":["The life of a Peace Corps\/Bolivia [x] is at once complex and simple; exhausting and fulfilling …","The [x] is expected to acquire this knowledge by:","Synopsis: A stingy merchant hires a [x] from the College and Order of Heralds to assist with alien languages and customs on a trade run to the low-tech planet Lyra.","She's a [x] from the newest class, originally from Russia (damn, discordian, do I just attract them?","Today\u0092s media [x] was the chief executive officer of a company that administered hospitals, twenty-eight of them throughout the southeastern United States."]},{"word":"apprentice","definitions":["One bound by legal agreement to work for another for a specific amount of time in return for instruction in a trade, art, or business.","One who is learning a trade or occupation, especially as a member of a labor union.","A beginner; a learner.","To place or take on as a beginner or learner."],"examples":["The term [x] makes me think back to early art days when a \"master\" would have a whole school of [x]s behind him, often doing his work.","In many of these stories, the [x] is a sorcerer's [x].","That being said, there is a uptick in the amount of restaurants we plan to build, we'll require a lot of new leadership and as the number of restaurateurs increase and as some of our restaurateurs are becoming what we call [x] team leaders which allows them to oversee a lot more restaurants, we feel better and better that the leadership will be such as to be ready and be able to run great restaurants when the economic situation changes and we're able to find even more real estate sites.","One of the greatest opportunities for the out-of-school unemployed youth and even many older unemployed workers, however, will always be found in [x] programs.","From the standpoint of right wing self-interest, narrowly construed, filling a liberal seat with an [x] is not a bad outcome."]},{"word":"teacher","definitions":["One who teaches, especially one hired to teach."],"examples":["The [x] who neither teaches nor can teach them to his pupils is a _bad [x]_; the pupil who, notwithstanding the urgent warnings of his [x], neglects the exercises that can help him to acquire them, and fails to perfect himself in them, is a _bungler_.","Such classroom observations are an absolute measure; the rating of a [x] is against a fixed yardstick of what constitutes good practice, not against other [x]s.","No, this particular rudeness just tells us the [x] is a pompous atheist.","This can be nice when a [x] is at a loss on how to approach a specific topic or just wants to try something new with his or her students.","First off all the [x] is the one who needs to change, and second, is this so called [x] still employed by the school district."]},{"word":"trainer","definitions":["One who trains, especially one who coaches athletes, racehorses, or show animals.","A contrivance or apparatus used in training.","A member of a naval gun crew who trains cannons horizontally."],"examples":["In which I reveal my muffin-top, my inability to properly clean mirrors, and the fact that my personal [x] is a Siamese cat.","This generally occurs as the animal [x] is coercing a large and\/or dangerous animal into doing something completely alien to its nature for the purpose of entertainment.","He said that if a certified athletic [x] is not available to a school, perhaps contact sports should be avoided.","Picture it: I am laying on a massage table with nine acupuncture needles in my left leg, and a physiotherapist attending to my arm, while my [x] is desperately trying to get me to focus on what to eat and what to order.","I have to admit that one of my biggest challenges as an amateur [x] is knowing the proper amount of pressure to apply when it comes to a reprimand."]},{"word":"instructor","definitions":["One who instructs; a teacher.","A college or university teacher who ranks below an assistant professor."],"examples":["I have to make note that the [x] is a big jerk off anyways – he never returned calls or emails, never available for help, and neither was the student assistant he had.","If you are at a dance studio, find out who their [x] is and talk to that person.","I'm a spin [x], and I hate to admit, but I would have done the same thing!!","The [x] is an older gentlemen, well-respected, and quite experienced, yet he broke at least 2 or 3 rules of gun safety.","Crossroads has a partnership with the Bell Museum and their I-Zone [x] is actually a scientist-in-residence who is a curator at the Bell."]},{"word":"computing","definitions":["Present participle of compute.","The process or act of calculation","Action of using (a) computer(s).","The study, field of computers and computer programming."],"examples":["Just thinking about likely near-term innovations in [x] is exciting, but slowly a longer-term vision is coming into focus.","The term [x] machine, used increasingly from the 1920s, refers to any machine that does the work of a human computer, i.e., any machine that calculates in accordance with effective methods.","Note: The use of * here is similar to its use in [x], that is, as a ‘wildcard’.","\"The future of [x] is about providing customers solutions from one vendor,\" Ellison said in a phone interview.","Cloud [x] is such a bad departure from one of the underlying concepts of the web that makes it so important and valuable."]},{"word":"fail","definitions":["To prove deficient or lacking; perform ineffectively or inadequately:  failed to fulfill their promises; failed in their attempt to reach the summit. ","To be unsuccessful:  an experiment that failed. ","To receive an academic grade below the acceptable minimum.","To prove insufficient in quantity or duration; give out:  The water supply failed during the drought. ","To decline, as in strength or effectiveness:  The light began to fail. ","To cease functioning properly:  The engine failed. ","To give way or be made otherwise useless as a result of excessive strain:  The rusted girders failed and caused the bridge to collapse. ","To become bankrupt or insolvent:  Their business failed during the last recession. ","To disappoint or prove undependable to:  Our sentries failed us. ","To abandon; forsake:  His strength failed him. ","To omit to perform (an expected duty, for example): \"We must . . . hold . . . those horrors up to the light of justice. Otherwise we would fail our inescapable obligation to the victims of Nazism: to remember”  ( Anthony Lewis). ","To leave undone; neglect:  failed to wash the dishes. ","To receive an academic grade below the acceptable minimum in (a course, for example):  failed algebra twice. ","To give such a grade of failure to (a student):  failed me in algebra. ","Failure to deliver securities to a purchaser within a specified time.","Failure to receive the proceeds of a transaction, as in the sale of stock or securities, by a specified date.","without fail  With no chance of failure:  Be here at noon without fail. "],"examples":["'You can't [x],' she said, '_I won't let you [x]_!'","[Illustration: \"And he,\" she said, \"has still a chance if -- I [x] you?\"] \"Of course -- if you _[x]_ me.\"","We shall not [x] -- if we stand firm, we _shall not [x]_.","Moreover, see whether the term [x] to be used in the same relation both when called by the name of its genus, and also when called by those of all the genera of its genus.","Q: You say that one way to [x] is to quit taking risks."]},{"word":"re-sit","definitions":[],"examples":["The person responsible should [x] their IT exams.","Any students caught cheating will be expelled, not allowed to [x] the examination the next year, and barred from entry to university.","What's your view of the feedback that should be provided and [x] requirements on failing a test?","Mr Kirk must now attend a taxpayer funded, four-week, part-time college course studying GCSE English before he can [x] the exam.","Meanwhile Geoff believes he is going to [x] at least two modules."]},{"word":"easy","definitions":["Capable of being accomplished or acquired with ease; posing no difficulty:  an easy victory; an easy problem. ","Requiring or exhibiting little effort or endeavor; undemanding:  took the easy way out of her problems; wasn't satisfied with easy answers. ","Free from worry, anxiety, trouble, or pain:  My mind was easy, knowing that I had done my best. ","Affording comfort or relief; soothing:  soft light that was easy on the eyes. ","Prosperous; well-off:  easy living; easy circumstances. ","Causing little hardship or distress:  an easy penalty; a habit that isn't easy to give up. ","Socially at ease:  an easy, good-natured manner. ","Relaxed in attitude; easygoing:  an easy disposition. ","Not strict or severe; lenient:  an easy teacher; easy standards. ","Readily exploited, imposed on, or tricked:  an easy mark; an easy victim. ","Not hurried or forced; moderate:  an easy pace; an easy walk around the block. ","Light; gentle:  an easy tap on the shoulder. ","Not steep or abrupt; gradual:  an easy climb. ","Economics   Less in demand and therefore readily obtainable:  Commodities are easier this quarter. ","Economics   Plentiful and therefore at low interest rates:  easy money. ","Promiscuous; loose.","Without haste or agitation:  Relax and take it easy for a while. ","With little effort; easily:  success that came too easy. ","In a restrained or moderate manner:  Go easy on the butter. ","Without much hardship or cost:  got off easy with only a small fine. ","easy as pie  Informal   Capable of being accomplished or done with no difficulty."],"examples":["…And that is that it will be [x], *[x]*, to sabotage a program this unpopular, once it passes.","I *know* it's [x] to love California and not as *[x]* when it comes to loving Michigan.","Use to be so [x], I never even tried\/Yeah, use to be so [x]\u0085","\"There -- [x] now -- _[x]_\" as she threatened to capsize this curious basin.","With a headlamp as his only light, Maslyn unseals an environmental door to reveal what he calls an [x] entrance tunnel - half a meter wide - the size of a dinner platter."]},{"word":"hard","definitions":["Resistant to pressure; not readily penetrated.","Physically toughened; rugged.","Mentally toughened; strong-minded.","Requiring great effort or endurance:  a hard assignment. ","Performed with or marked by great diligence or energy:  a project that required years of hard work. ","Difficult to resolve, accomplish, or finish:  That was a hard question. ","Difficult to understand or impart:  Physics was the hardest of my courses. Thermodynamics is a hard course to teach. ","Intense in force or degree:  a hard blow. ","Inclement:  a long, hard winter. ","Stern or strict in nature or comportment:  a hard taskmaster. ","Resistant to persuasion or appeal; obdurate.","Making few concessions:  drives a hard bargain. ","Difficult to endure:  a hard life. ","Oppressive or unjust in nature or effect:  restrictions that were hard on welfare applicants. ","Lacking compassion or sympathy; callous.","Harsh or severe in effect or intention:  said some hard things that I won't forget. ","Bitter; resentful:  No hard feelings, I hope. ","Causing damage or premature wear:  Snow and ice are hard on a car's finish. ","Bad; adverse:  hard luck. ","Proceeding or performing with force, vigor, or persistence; assiduous:  a hard worker. ","Real and unassailable:  hard evidence. ","Definite; firm:  a hard commitment. ","Close; penetrating:  We need to take a hard look at the situation. ","Free from illusion or bias; practical:  brought some hard common sense to the discussion. ","Using or based on data that are readily quantified or verified:  the hard sciences. ","Marked by sharp outline or definition; stark.","Lacking in delicacy, shading, or nuance.","Hard-core.","Being a turn in a specific direction at an angle more acute than other possible routes.","Metallic, as opposed to paper. Used of currency.","Backed by bullion rather than by credit. Used of currency.","High and stable. Used of prices.","Durable; lasting:  hard merchandise. ","Written or printed rather than stored in electronic media:  sent the information by hard mail. ","Erect; tumid. Used of a penis.","Having high alcoholic content; intoxicating:  hard liquor. ","Rendered alcoholic by fermentation; fermented:  hard cider. ","Containing dissolved salts that interfere with the lathering action of soap. Used of water.","Linguistics   Velar, as in c in cake or g in log, as opposed to palatal or soft.","Physics   Of relatively high energy; penetrating:  hard x-rays. ","High in gluten content:  hard wheat. ","Chemistry   Resistant to biodegradation:  a hard detergent. ","Physically addictive. Used of certain illegal drugs, such as heroin.","Resistant to blast, heat, or radiation. Used especially of nuclear weapons.","With strenuous effort; intently:  worked hard all day; stared hard at the accused criminal. ","With great force, vigor, or energy:  pressed hard on the lever. ","In such a way as to cause great damage or hardship:  industrial cities hit hard by unemployment. ","With great distress, grief, or bitterness:  took the divorce hard. ","Firmly; securely:  held hard to the railing. ","Toward or into a solid condition:  concrete that sets hard within a day. ","Near in space or time; close:  The factory stands hard by the railroad tracks. ","Nautical   Completely; fully:  hard alee. ","hard and fast  Defined, fixed, and invariable:  hard and fast rules. ","hard of hearing  Having a partial loss of hearing.","hard of hearing  One who has a partial loss of hearing.","hard put  Undergoing great difficulty:  Under the circumstances, he was hard put to explain himself. ","hard up  Informal   In need; poor."],"examples":["The pressure squeezes and pulls at my chest so [x], so [x]\u0085 so very [x], it is like you can feel the muscle fibers tearing and popping as my heart races and slows erratically.","'Well, as it is your graduation from kindergarten, and next year you will be in [x] school ... '~-[x] school was what Shana and Sylvia called it because they had homework - \"you will probably not want to hear my little story ever again.\"","The fact is, _I work [x] and I play [x]_, and I believe each is equally necessary for good health and real happiness.","'These Christians are [x] -- _[x]_!' thought Eleanor sharply, closing her tired lids.","My God! Effie, it is a [x] world -- it is [x], _[x]_ to keep straight in it."]},{"word":"useful","definitions":["Having a beneficial use; serviceable:  a useful kitchen gadget. ","Being of practical use:  a useful job; useful members of society. "],"examples":["In this workshop, children are invited to make educational and [x] toys - \u0091[x]\u0092 in the sense that they help with a child\u0092s early development, providing stimulation, exercise, use of the senses, and learning of skills.","Let a child be employed -- take an interest in his employment, let him fancy that he is [x] -- _and he is [x]_, he is laying in a stock of health.","Exactly the same difficulty arises, when we endeavour to account for the development of the moral sense or conscience in savage man; for although the _practice_ of benevolence, honesty, or truth, may have been [x] to the tribe possessing these virtues, that does not at all account for the peculiar _sanctity_, attached to actions which each tribe considers right and moral, as contrasted with the very different feelings with which they regard what is merely _[x]_.","Carnot’s experiments also showed that thermodynamic laws are essentially economic formulations of physical relations, for the terms ’[x]’ and ’unavailable’ energy refer to the economy’s ability to use energy to upgrade the organizational state of natural resources into [x] goods and services.","The word [x] came out with a spiteful, bitter twist."]}]